{
    "data_area": [
        "distillation",
        "generation"
    ],
    "paper": {
        "image": "images/fang2019data.png",
        "title": "Data-Free Adversarial Distillation",
        "authors": [
            "Gongfan Fang",
            "Jie Song",
            {
                "name": "Chengchao Shen",
                "is_me": true
            },
            "Xinchao Wang",
            "Da Chen",
            "Mingli Song"
        ],
        "venue": {
            "name": "ArXiv:1912.11006",
            "short_name": "",
            "ranking": "",
            "year": 2019
        },
        "links": {
            "arxiv": "https://arxiv.org/abs/1912.11006",
            "code": "https://github.com/VainF/Data-Free-Adversarial-Distillation"
        },
        "bibtex": "\n@article{fang2019data,\n    title={Data-free adversarial distillation},\n    author={Fang, Gongfan and Song, Jie and Shen, Chengchao and Wang, Xinchao and Chen, Da and Song, Mingli},\n    journal={arXiv preprint arXiv:1912.11006},\n    year={2019}\n}\n",
        "abstract": "Knowledge Distillation (KD) has made remarkable progress in the last few years and become a popular paradigm for model compression and knowledge transfer. However, almost all existing KD algorithms are data-driven, i.e., relying on a large amount of original training data or alternative data, which is usually unavailable in real-world scenarios. In this paper, we devote ourselves to this challenging problem and propose a novel adversarial distillation mechanism to craft a compact student model without any real-world data. We introduce a model discrepancy to quantificationally measure the difference between student and teacher models and construct an optimizable upper bound. In our work, the student and the teacher jointly act the role of the discriminator to reduce this discrepancy, when a generator adversarially produces some \"hard samples\" to enlarge it. Extensive experiments demonstrate that the proposed data-free method yields comparable performance to existing data-driven methods. More strikingly, our approach can be directly extended to semantic segmentation, which is more complicated than classification, and our approach achieves state-of-the-art results.",
        "github": {
            "user": "VainF",
            "repo": "Data-Free-Adversarial-Distillation"
        }
    }
}