{
    "data_area": [
        "zero-shot"
    ],
    "paper": {
        "image": "images/song2018selective.png",
        "title": "Selective Zero-Shot Classification With Augmented Attributes",
        "authors": [
            "Jie Song",
            {
                "name": "Chengchao Shen",
                "is_me": true
            },
            "Jie Lei",
            "An-Xiang Zeng",
            "Kairi Ou",
            "Dacheng Tao",
            "Mingli Song"
        ],
        "venue": {
            "name": "The European Conference on Computer Vision",
            "short_name": "ECCV",
            "ranking": "CCF B",
            "year": 2018
        },
        "links": {
            "paper": "http://openaccess.thecvf.com/content_ECCV_2018/papers/Jie_Song_Selective_Zero-Shot_Classification_ECCV_2018_paper.pdf",
            "arxiv": "http://arxiv.org/abs/1807.07437v1"
        },
        "bibtex": "\n@inproceedings{song2018selective,\n    title={Selective zero-shot classification with augmented attributes},\n    author={Song, Jie and Shen, Chengchao and Lei, Jie and Zeng, An-Xiang and Ou, Kairi and Tao, Dacheng and Song, Mingli},\n    booktitle={Proceedings of the European Conference on Computer Vision (ECCV)},\n    pages={468--483},\n    year={2018}\n}\n",
        "abstract": "In this paper, we introduce a selective zero-shot classification problem: how can the classifier avoid making dubious predictions? Existing attribute-based zero-shot classification methods are shown to work poorly in the selective classification scenario. We argue the under-complete human defined attribute vocabulary accounts for the poor performance. We propose a selective zero-shot classifier based on both the human defined and the automatically discovered residual attributes. The proposed classifier is constructed by firstly learning the defined and the residual attributes jointly. Then the predictions are conducted within the subspace of the defined attributes. Finally, the prediction confidence is measured by both the defined and the residual attributes. Experiments conducted on several benchmarks demonstrate that our classifier produces a superior performance to other methods under the risk-coverage trade-off metric."
    }
}